# Import libraries

In [1]:
import numpy as np 
import pandas as pd 
from sklearn import preprocessing

## Load data

In [2]:
country = pd.read_csv('c_data.csv', header= 2)

In [3]:
country.head()

,1,Country,CountryCode,Population growth,Total population,Area (sq. km)
0,2,Brazil,BRA,0.817556,207652865.0,8358140.0
1,3,Switzerland,CHE,1.077221,8372098.0,39516.0
2,4,Germany,DEU,1.193867,82667685.0,348900.0
3,5,Denmark,DNK,0.834638,NaN,42262.0
4,6,Spain,ESP,-0.008048,46443959.0,500210.0

In [20]:
country = country.rename(columns= {' Country': 'name', 'CountryCode' : 'code',
                         'Population growth' : 'rate_pop', 'Total population' : 'tot_pop',
                         'Area (sq. km)':'area'})

In [21]:
country.shape

(16, 5)

In [22]:
country.head()

          name code  rate_pop      tot_pop       area
0       Brazil  BRA  0.817556  207652865.0  8358140.0
1  Switzerland  CHE  1.077221    8372098.0    39516.0
2      Germany  DEU  1.193867   82667685.0   348900.0
3      Denmark  DNK  0.834638          NaN    42262.0
4        Spain  ESP -0.008048   46443959.0   500210.0

In [23]:
country.drop('code', axis=1, inplace= True)

In [24]:
country.head()

          name  rate_pop      tot_pop       area
0       Brazil  0.817556  207652865.0  8358140.0
1  Switzerland  1.077221    8372098.0    39516.0
2      Germany  1.193867   82667685.0   348900.0
3      Denmark  0.834638          NaN    42262.0
4        Spain -0.008048   46443959.0   500210.0

In [27]:
country.set_index('name', inplace= True)

In [38]:
country.loc['World']

rate_pop    1.181680e+00
tot_pop     7.442136e+09
area        1.297332e+08
Name: World, dtype: float64

In [30]:
country.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16 entries, Brazil to World
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   rate_pop  14 non-null     float64
 1   tot_pop   15 non-null     float64
 2   area      15 non-null     float64
dtypes: float64(3)
memory usage: 512.0+ bytes

In [31]:
country.describe(include= 'all')

        rate_pop       tot_pop          area
count  14.000000  1.500000e+01  1.500000e+01
mean    1.145492  6.422767e+08  9.762744e+06
std     1.173195  1.909868e+09  3.325701e+07
min    -0.687543  2.569804e+06  1.161000e+04
25%     0.510007  1.032493e+07  2.389000e+05
50%     1.112718  6.689611e+07  4.463000e+05
75%     1.190820  1.564921e+08  1.269765e+06
max     3.495070  7.442136e+09  1.297332e+08

In [36]:
max_pop = country['tot_pop'].max()
country['tot_pop'][country['tot_pop'] == max_pop]

name
World    7.442136e+09
Name: tot_pop, dtype: float64

In [43]:
country.drop('World', axis= 0, inplace= True)

## Missing value

In [45]:
country.isnull()

             rate_pop  tot_pop   area
name
Brazil          False    False  False
Switzerland     False    False  False
Germany         False    False  False
Denmark         False     True  False
Spain           False    False  False
France          False    False  False
Japan           False    False  False
Greece          False    False  False
Iran            False    False  False
Kuwait          False    False   True
Morocco          True    False  False
Nigeria         False    False  False
Qatar           False    False  False
Sweden           True    False  False
India           False    False  False

In [46]:
# country.replace('?', np.NaN, inplace= True)

In [47]:
country.isnull().sum()

rate_pop    2
tot_pop     1
area        1
dtype: int64

In [49]:
country

             rate_pop       tot_pop       area
name
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638           NaN    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06        NaN
Morocco           NaN  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden            NaN  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

In [48]:
country.dropna(axis= 0)

             rate_pop       tot_pop       area
name
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
India        1.148215  1.324171e+09  2973190.0

In [52]:
country.fillna({'rate_pop':country.rate_pop.mean(), 
               'tot_pop':country.tot_pop.mean(),
               'area':country.area.min()})

             rate_pop       tot_pop       area
name
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638  1.565725e+08    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06    11610.0
Morocco      1.142708  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden       1.142708  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

In [53]:
# Fill Nan with forward simple
country.fillna(method= 'ffill')

             rate_pop       tot_pop       area
name
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638  8.266768e+07    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06  1628760.0
Morocco      2.924206  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden       3.495070  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

## Imputation

In [58]:
# imputer
from sklearn.impute import SimpleImputer

In [60]:
imp = SimpleImputer(missing_values= np.nan, strategy= 'mean')

In [62]:
imp.fit(country)

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='mean', verbose=0)

In [63]:
new_dataset = imp.transform(country)

In [65]:
new_dataset

array([[ 8.17555711e-01,  2.07652865e+08,  8.35814000e+06],
       [ 1.07722117e+00,  8.37209800e+06,  3.95160000e+04],
       [ 1.19386676e+00,  8.26676850e+07,  3.48900000e+05],
       [ 8.34637611e-01,  1.56572478e+08,  4.22620000e+04],
       [-8.04808600e-03,  4.64439590e+07,  5.00210000e+05],
       [ 4.07491036e-01,  6.68961090e+07,  5.47557000e+05],
       [-1.15284177e-01,  1.26994511e+08,  3.64560000e+05],
       [-6.87542545e-01,  1.07467400e+07,  1.28900000e+05],
       [ 1.14878860e+00,  8.02774280e+07,  1.62876000e+06],
       [ 2.92420619e+00,  4.05258400e+06,  1.19342750e+06],
       [ 1.14270849e+00,  3.52767860e+07,  4.46300000e+05],
       [ 2.61903353e+00,  1.85989640e+08,  9.10770000e+05],
       [ 3.49506992e+00,  2.56980400e+06,  1.16100000e+04],
       [ 1.14270849e+00,  9.90312200e+06,  4.07310000e+05],
       [ 1.14821469e+00,  1.32417135e+09,  2.97319000e+06]])

## Dupplicates

In [72]:
country.duplicated()

name
Brazil         False
Switzerland    False
Germany        False
Denmark        False
Spain          False
France         False
Japan          False
Greece         False
Iran           False
Kuwait         False
Morocco        False
Nigeria        False
Qatar          False
Sweden         False
India          False
dtype: bool

In [71]:
country.duplicated('rate_pop')

name
Brazil         False
Switzerland    False
Germany        False
Denmark        False
Spain          False
France         False
Japan          False
Greece         False
Iran           False
Kuwait         False
Morocco        False
Nigeria        False
Qatar          False
Sweden          True
India          False
dtype: bool

## Concatenating

In [75]:
dict1 = {'col1':['babak', 'raha', 'sara', 'reza'],
        'col2':[1,2,3,4],
        'col3':[13,14,17,12],
        'col4':[17,14,12,18],
        'col5':[17,15,20,19]}
my_source_one = pd.DataFrame(data= dict1)
my_source_one

    col1  col2  col3  col4  col5
0  babak     1    13    17    17
1   raha     2    14    14    15
2   sara     3    17    12    20
3   reza     4    12    18    19

In [77]:
dict2 = {'col1': ['babak', 'baran', 'sara', 'arash', 'mahan','reza'],
        'col2' : [1,2,3,4,5,6],
        'col3' : [13, 15,14, 20, 15, 14],
        'col4' : [17, 20, 19, 19, 18, 12]}
my_source_two = pd.DataFrame(data= dict2)
my_source_two

    col1  col2  col3  col4
0  babak     1    13    17
1  baran     2    15    20
2   sara     3    14    19
3  arash     4    20    19
4  mahan     5    15    18
5   reza     6    14    12

In [78]:
my_source_connat = pd.concat([my_source_one, my_source_two], axis= 0, ignore_index= True)
my_source_connat

    col1  col2  col3  col4  col5
0  babak     1    13    17  17.0
1   raha     2    14    14  15.0
2   sara     3    17    12  20.0
3   reza     4    12    18  19.0
4  babak     1    13    17   NaN
5  baran     2    15    20   NaN
6   sara     3    14    19   NaN
7  arash     4    20    19   NaN
8  mahan     5    15    18   NaN
9   reza     6    14    12   NaN

In [79]:
my_source_connat2 = pd.concat([my_source_one, my_source_two], axis= 1, ignore_index= True)
my_source_connat2

       0    1     2     3     4      5  6   7   8
0  babak  1.0  13.0  17.0  17.0  babak  1  13  17
1   raha  2.0  14.0  14.0  15.0  baran  2  15  20
2   sara  3.0  17.0  12.0  20.0   sara  3  14  19
3   reza  4.0  12.0  18.0  19.0  arash  4  20  19
4    NaN  NaN   NaN   NaN   NaN  mahan  5  15  18
5    NaN  NaN   NaN   NaN   NaN   reza  6  14  12

In [81]:
my_source_connat.drop('col5', axis= 1, inplace= True)

In [90]:
my_source_connat.drop_duplicates(inplace= True)

In [91]:
my_source_connat.reset_index(drop= True, inplace= True)

In [92]:
my_source_connat

    col1  col2  col3  col4
0  babak     1    13    17
1   raha     2    14    14
2   sara     3    17    12
3   reza     4    12    18
4  baran     2    15    20
5   sara     3    14    19
6  arash     4    20    19
7  mahan     5    15    18
8   reza     6    14    12